app/views/budgets/show.html.erb

 </div>
 <% @budget.categories.each do |category| %>
---
SELECT "categories".* FROM "categories" INNER JOIN "budget_categories" ON "categories"."id" = "budget_categories"."category_id" WHERE "budget_categories"."budget_id" = $1  [["budget_id", 1]]