app/controllers/sessions_controller.rb

  def create
    user = User.find_by(params[:email])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "daniel@gmail.com"], ["LIMIT", 1]]